Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator Methods
The AnalysisObjectEnumerator type exposes the following members.
Methods
Name | Description
GetEnumerator
 Returns a pointer to the existing instance of the class. This allows the usage of the foreach statement with AnalysisObjectEnumerator.
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Refresh
 Refreshes the enumerator with latest data at database.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace